zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_fmc_nand.c
/*
 * Copyright (c) 2025 Endress+Hauser GmbH+Co. KG
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_fmc_nand

#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/flash/nand_flash_api_ex.h>
#include <zephyr/drivers/memc/memc_stm32.h>
#include <zephyr/kernel.h>

#include "flash_stm32_fmc_nand.h"

#define STM32_FMC_NAND_USE_DMA DT_ANY_INST_HAS_PROP_STATUS_OKAY(dmas)

#if STM32_FMC_NAND_USE_DMA
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <stm32_ll_dma.h>
#endif /* STM32_FMC_NAND_USE_DMA */

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(flash_stm32_fmc_nand, CONFIG_FLASH_LOG_LEVEL);

#define DMA_TIMEOUT_MS        1000
#define NAND_CMD_SET_FEATURES ((uint8_t)0xEF)
#define NAND_TIMEOUT_MS       2000
#define PAGE_BUFFER_ALIGNMENT 4

#define STM32_FMC_NAND_ARRAY_ADDRESS(address, data)                                                \
	((address)->page +                                                                         \
	 (((address)->block + ((address)->plane * (data)->plane_size)) * (data)->block_size))

#define STM32_FMC_NAND_COLUMN_ADDRESS(data) ((data)->page_size)

#if STM32_FMC_NAND_USE_DMA
static const uint32_t table_src_size[] = {
	LL_DMA_SRC_DATAWIDTH_BYTE,
	LL_DMA_SRC_DATAWIDTH_HALFWORD,
	LL_DMA_SRC_DATAWIDTH_WORD,
};

static const uint32_t table_dest_size[] = {
	LL_DMA_DEST_DATAWIDTH_BYTE,
	LL_DMA_DEST_DATAWIDTH_HALFWORD,
	LL_DMA_DEST_DATAWIDTH_WORD,
};

/* Lookup table to set dma priority from the DTS */
static const uint32_t table_priority[] = {
	LL_DMA_LOW_PRIORITY_LOW_WEIGHT,
	LL_DMA_LOW_PRIORITY_MID_WEIGHT,
	LL_DMA_LOW_PRIORITY_HIGH_WEIGHT,
	LL_DMA_HIGH_PRIORITY,
};

struct stream {
	bool enabled;
	DMA_HandleTypeDef handle;
	DMA_TypeDef *reg;
	const struct device *dev;
	uint32_t channel;
	struct dma_config cfg;
	struct dma_block_config block_cfg;
};
#endif /* STM32_FMC_NAND_USE_DMA */

enum nand_state {
	NAND_STATE_RESET = 0, /* Not yet initialised or disabled */
	NAND_STATE_READY,     /* Initialised and ready */
	NAND_STATE_BUSY,      /* Busy */
	NAND_STATE_ERROR,     /* Failed */
};

struct flash_stm32_fmc_nand_config {
	uint8_t *page_buffer;
};

struct flash_stm32_fmc_nand_data {
	FMC_NAND_TypeDef *instance;
	FMC_NAND_InitTypeDef init;
	struct k_sem lock;
	enum nand_state state;
	size_t page_size;       /* Page size in bytes or words depending on addressing */
	size_t spare_area_size; /* Spare area size in bytes or words depending on addressing */
	size_t block_size;      /* Block size in number of pages */
	size_t plane_size;      /* Plane size in number of blocks */
	size_t total_pages;     /* Total number of pages */
#if STM32_FMC_NAND_USE_DMA
	struct stream dma;
#endif /* STM32_FMC_NAND_USE_DMA */
};

/* Reads status until NAND is ready or reports an error */
static int flash_stm32_fmc_nand_wait(void)
{
	uint8_t status;
	k_timepoint_t deadline;

	deadline = sys_timepoint_calc(SYS_TIMEOUT_MS(NAND_TIMEOUT_MS));
	while (true) {
		/* Send read status operation command */
		sys_write8(NAND_CMD_STATUS, NAND_DEVICE | CMD_AREA);

		/* Read status register data */
		status = sys_read8(NAND_DEVICE);

		if ((status & NAND_READY) == NAND_READY) {
			break;
		} else if ((status & NAND_ERROR) == NAND_ERROR) {
			return -EIO;
		} else if (sys_timepoint_expired(deadline)) {
			return -ETIMEDOUT;
		}
	}

	return 0;
}

int flash_stm32_fmc_nand_read_page_chunk(const struct device *dev,
					 const struct nand_flash_address *address,
					 off_t page_offset, size_t chunk, uint8_t *data)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;
	const struct flash_stm32_fmc_nand_config *config = dev->config;
	uint32_t nand_address;
	int ret;

	k_sem_take(&dev_data->lock, K_FOREVER);

	if (dev_data->state == NAND_STATE_BUSY) {
		k_sem_give(&dev_data->lock);
		return -EBUSY;
	} else if (dev_data->state != NAND_STATE_READY) {
		k_sem_give(&dev_data->lock);
		return -EIO;
	}

	dev_data->state = NAND_STATE_BUSY;
	nand_address = STM32_FMC_NAND_ARRAY_ADDRESS(address, dev_data); /* Raw NAND address */

	/* Send read page command sequence */
	sys_write8(NAND_CMD_AREA_A, NAND_DEVICE | CMD_AREA);

	if (dev_data->page_size <= 512) {
		if (dev_data->total_pages <= 65535) {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		} else {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		}
	} else {
		if (dev_data->total_pages <= 65535) {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		} else {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		}
	}

	sys_write8(NAND_CMD_AREA_TRUE1, NAND_DEVICE | CMD_AREA);

	/* Read status until NAND is ready or reports an error */
	ret = flash_stm32_fmc_nand_wait();
	if (ret == -EIO) {
		LOG_ERR("Uncorrectable ECC error detected");
		dev_data->state = NAND_STATE_READY;
		k_sem_give(&dev_data->lock);
		return ret;
	} else if (ret == -ETIMEDOUT) {
		dev_data->state = NAND_STATE_ERROR;
		k_sem_give(&dev_data->lock);
		return ret;
	}

	/* Go back to read mode */
	sys_write8(NAND_CMD_AREA_A, NAND_DEVICE | CMD_AREA);

#if STM32_FMC_NAND_USE_DMA
	if (dev_data->dma.enabled) {
		/* Get page data into buffer */
		if (HAL_DMA_Start(&dev_data->dma.handle, NAND_DEVICE, (uint32_t)config->page_buffer,
				  dev_data->page_size) != HAL_OK) {
			dev_data->state = NAND_STATE_ERROR;
			k_sem_give(&dev_data->lock);
			return -EIO;
		}
		if (HAL_DMA_PollForTransfer(&dev_data->dma.handle, HAL_DMA_FULL_TRANSFER,
					    DMA_TIMEOUT_MS) != HAL_OK) {
			dev_data->state = NAND_STATE_ERROR;
			k_sem_give(&dev_data->lock);
			return -EIO;
		}

		/* Get chunk into output buffer */
		if (dma_reload(dev_data->dma.dev, dev_data->dma.channel,
			       (uint32_t)(config->page_buffer + page_offset), (uint32_t)data,
			       chunk) != 0) {
			dev_data->state = NAND_STATE_ERROR;
			k_sem_give(&dev_data->lock);
			return -EIO;
		}
	} else {
#endif /* STM32_FMC_NAND_USE_DMA */

		/* Get page data into buffer */
		for (size_t index = 0; index < dev_data->page_size; index++) {
			config->page_buffer[index] = sys_read8(NAND_DEVICE);
		}

		/* Get chunk into output buffer */
		memcpy(data, &config->page_buffer[page_offset], chunk);

#if STM32_FMC_NAND_USE_DMA
	}
#endif /* STM32_FMC_NAND_USE_DMA */

	dev_data->state = NAND_STATE_READY;
	k_sem_give(&dev_data->lock);

