zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_fmc_nand.c
	return 0;
}

int flash_stm32_fmc_nand_read_spare_area(const struct device *dev,
					 const struct nand_flash_address *address, uint8_t *data)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;
	uint32_t nand_address, column_address;
	uint8_t *buffer = data;
	int ret;

	k_sem_take(&dev_data->lock, K_FOREVER);

	if (dev_data->state == NAND_STATE_BUSY) {
		k_sem_give(&dev_data->lock);
		return -EBUSY;
	} else if (dev_data->state != NAND_STATE_READY) {
		k_sem_give(&dev_data->lock);
		return -EIO;
	}

	dev_data->state = NAND_STATE_BUSY;
	nand_address = STM32_FMC_NAND_ARRAY_ADDRESS(address, dev_data); /* Raw NAND address */
	column_address = STM32_FMC_NAND_COLUMN_ADDRESS(dev_data);

	/* Send read spare area command sequence */
	if (dev_data->page_size <= 512) {
		sys_write8(NAND_CMD_AREA_C, NAND_DEVICE | CMD_AREA);

		if (dev_data->total_pages <= 65535) {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		} else {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		}
	} else {
		sys_write8(NAND_CMD_AREA_A, NAND_DEVICE | CMD_AREA);

		if (dev_data->total_pages <= 65535) {
			sys_write8(COLUMN_1ST_CYCLE(column_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(COLUMN_2ND_CYCLE(column_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		} else {
			sys_write8(COLUMN_1ST_CYCLE(column_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(COLUMN_2ND_CYCLE(column_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		}
	}

	sys_write8(NAND_CMD_AREA_TRUE1, NAND_DEVICE | CMD_AREA);

	/* Read status until NAND is ready or reports an error */
	ret = flash_stm32_fmc_nand_wait();
	if (ret == -EIO) {
		LOG_ERR("Uncorrectable ECC error detected");
		dev_data->state = NAND_STATE_READY;
		k_sem_give(&dev_data->lock);
		return ret;
	} else if (ret == -ETIMEDOUT) {
		dev_data->state = NAND_STATE_ERROR;
		k_sem_give(&dev_data->lock);
		return ret;
	}

	/* Go back to read mode */
	sys_write8(NAND_CMD_AREA_A, NAND_DEVICE | CMD_AREA);

	/* Get spare area data into output buffer */
	for (size_t index = 0; index < dev_data->spare_area_size; index++) {
		*buffer = sys_read8(NAND_DEVICE);
		buffer++;
	}

	dev_data->state = NAND_STATE_READY;
	k_sem_give(&dev_data->lock);

	return 0;
}

int flash_stm32_fmc_nand_write_page(const struct device *dev,
				    const struct nand_flash_address *address, const uint8_t *data)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;
	uint32_t nand_address;
	const uint8_t *buffer = data;
	int ret;

	k_sem_take(&dev_data->lock, K_FOREVER);

	if (dev_data->state == NAND_STATE_BUSY) {
		k_sem_give(&dev_data->lock);
		return -EBUSY;
	} else if (dev_data->state != NAND_STATE_READY) {
		k_sem_give(&dev_data->lock);
		return -EIO;
	}

	dev_data->state = NAND_STATE_BUSY;
	nand_address = STM32_FMC_NAND_ARRAY_ADDRESS(address, dev_data); /* Raw NAND address */

	/* Send write page command sequence */
	sys_write8(NAND_CMD_AREA_A, NAND_DEVICE | CMD_AREA);
	sys_write8(NAND_CMD_WRITE0, NAND_DEVICE | CMD_AREA);

	if (dev_data->page_size <= 512) {
		if (dev_data->total_pages <= 65535) {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		} else {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		}
	} else {
		if (dev_data->total_pages <= 65535) {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		} else {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		}
	}

	/* Write data to memory */
	for (size_t index = 0; index < dev_data->page_size; index++) {
		sys_write8(*buffer, NAND_DEVICE);
		buffer++;
	}

	sys_write8(NAND_CMD_WRITE_TRUE1, NAND_DEVICE | CMD_AREA);

	/* Read status until NAND is ready or reports an error */
	ret = flash_stm32_fmc_nand_wait();
	if (ret != 0) {
		dev_data->state = NAND_STATE_ERROR;
		k_sem_give(&dev_data->lock);
		return ret;
	}

	dev_data->state = NAND_STATE_READY;
	k_sem_give(&dev_data->lock);

	return 0;
}

int flash_stm32_fmc_nand_write_spare_area(const struct device *dev,
					  const struct nand_flash_address *address,
					  const uint8_t *data)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;
	uint32_t nand_address, column_address;
	const uint8_t *buffer = data;
	int ret;

	k_sem_take(&dev_data->lock, K_FOREVER);

	if (dev_data->state == NAND_STATE_BUSY) {
		k_sem_give(&dev_data->lock);
		return -EBUSY;
	} else if (dev_data->state != NAND_STATE_READY) {
		k_sem_give(&dev_data->lock);
		return -EIO;
	}

	dev_data->state = NAND_STATE_BUSY;
	nand_address = STM32_FMC_NAND_ARRAY_ADDRESS(address, dev_data); /* Raw NAND address */
	column_address = STM32_FMC_NAND_COLUMN_ADDRESS(dev_data);

	/* Send write spare area command sequence */
	if (dev_data->page_size <= 512) {
		sys_write8(NAND_CMD_AREA_C, NAND_DEVICE | CMD_AREA);
		sys_write8(NAND_CMD_WRITE0, NAND_DEVICE | CMD_AREA);

		if (dev_data->total_pages <= 65535) {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		} else {
			sys_write8(0x00, NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		}
	} else {
		sys_write8(NAND_CMD_AREA_A, NAND_DEVICE | CMD_AREA);
		sys_write8(NAND_CMD_WRITE0, NAND_DEVICE | CMD_AREA);

		if (dev_data->total_pages <= 65535) {
			sys_write8(COLUMN_1ST_CYCLE(column_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(COLUMN_2ND_CYCLE(column_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		} else {
			sys_write8(COLUMN_1ST_CYCLE(column_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(COLUMN_2ND_CYCLE(column_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
			sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
		}
	}

	/* Write data to memory */
	for (size_t index = 0; index < dev_data->spare_area_size; index++) {
		sys_write8(*buffer, NAND_DEVICE);
		buffer++;
	}

	sys_write8(NAND_CMD_WRITE_TRUE1, NAND_DEVICE | CMD_AREA);

	/* Read status until NAND is ready or reports an error */
	ret = flash_stm32_fmc_nand_wait();
	if (ret != 0) {
		dev_data->state = NAND_STATE_ERROR;
		k_sem_give(&dev_data->lock);
		return ret;
	}

	dev_data->state = NAND_STATE_READY;
	k_sem_give(&dev_data->lock);

