zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_fmc_nand.c
	return 0;
}

int flash_stm32_fmc_nand_erase_block(const struct device *dev,
				     const struct nand_flash_address *address)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;
	uint32_t nand_address;
	int ret;

	k_sem_take(&dev_data->lock, K_FOREVER);

	if (dev_data->state == NAND_STATE_BUSY) {
		k_sem_give(&dev_data->lock);
		return -EBUSY;
	} else if (dev_data->state != NAND_STATE_READY) {
		k_sem_give(&dev_data->lock);
		return -EIO;
	}

	dev_data->state = NAND_STATE_BUSY;
	nand_address = STM32_FMC_NAND_ARRAY_ADDRESS(address, dev_data); /* Raw NAND address */

	/* Send erase block command sequence */
	sys_write8(NAND_CMD_ERASE0, NAND_DEVICE | CMD_AREA);

	sys_write8(ADDR_1ST_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
	sys_write8(ADDR_2ND_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);
	sys_write8(ADDR_3RD_CYCLE(nand_address), NAND_DEVICE | ADDR_AREA);

	sys_write8(NAND_CMD_ERASE1, NAND_DEVICE | CMD_AREA);

	/* Read status until NAND is ready or reports an error */
	ret = flash_stm32_fmc_nand_wait();
	if (ret == -EIO) {
		LOG_ERR("Bad block detected");
		dev_data->state = NAND_STATE_READY;
		k_sem_give(&dev_data->lock);
		return ret;
	} else if (ret == -ETIMEDOUT) {
		dev_data->state = NAND_STATE_ERROR;
		k_sem_give(&dev_data->lock);
		return ret;
	}

	dev_data->state = NAND_STATE_READY;
	k_sem_give(&dev_data->lock);

	return 0;
}

int flash_stm32_fmc_nand_init_bank(const struct device *dev,
				   const struct flash_stm32_fmc_nand_init *init)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;

	k_sem_take(&dev_data->lock, K_FOREVER);

	dev_data->instance = FMC_NAND_DEVICE;

	if (init->bank == 3) {
		dev_data->init.NandBank = FMC_NAND_BANK3;
	} else {
		LOG_ERR("Unsupported FMC NAND bank %d", init->bank);
		k_sem_give(&dev_data->lock);
		return -EINVAL;
	}

	dev_data->init.Waitfeature = FMC_NAND_WAIT_FEATURE_ENABLE;
	dev_data->init.MemoryDataWidth = FMC_NAND_MEM_BUS_WIDTH_8;
	dev_data->init.EccComputation = FMC_NAND_ECC_DISABLE;
	dev_data->init.ECCPageSize = FMC_NAND_ECC_PAGE_SIZE_2048BYTE;
	dev_data->init.TCLRSetupTime = 0;
	dev_data->init.TARSetupTime = 0;

	dev_data->page_size = init->page_size;
	dev_data->spare_area_size = init->spare_area_size;
	dev_data->block_size = init->block_size / init->page_size;
	dev_data->plane_size = init->plane_size / init->block_size;
	dev_data->total_pages = init->flash_size / init->page_size;

	(void)FMC_NAND_Init(dev_data->instance, &dev_data->init);

	FMC_NAND_PCC_TimingTypeDef timing = {
		.SetupTime = init->setup_time,
		.WaitSetupTime = init->wait_setup_time,
		.HoldSetupTime = init->hold_setup_time,
		.HiZSetupTime = init->hiz_setup_time,
	};

	(void)FMC_NAND_CommonSpace_Timing_Init(dev_data->instance, &timing,
					       dev_data->init.NandBank);
	(void)FMC_NAND_AttributeSpace_Timing_Init(dev_data->instance, &timing,
						  dev_data->init.NandBank);

	__FMC_NAND_ENABLE(dev_data->instance);
	__FMC_ENABLE();

	dev_data->state = NAND_STATE_READY;
	k_sem_give(&dev_data->lock);

	return 0;
}

int flash_stm32_fmc_nand_reset(const struct device *dev)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;

	k_sem_take(&dev_data->lock, K_FOREVER);

	if (dev_data->state == NAND_STATE_BUSY) {
		k_sem_give(&dev_data->lock);
		return -EBUSY;
	} else if (dev_data->state != NAND_STATE_READY) {
		k_sem_give(&dev_data->lock);
		return -EIO;
	}

	dev_data->state = NAND_STATE_BUSY;

	/* Send NAND reset command */
	sys_write8(NAND_CMD_RESET, NAND_DEVICE | CMD_AREA);

	dev_data->state = NAND_STATE_READY;
	k_sem_give(&dev_data->lock);

	return 0;
}

int flash_stm32_fmc_nand_set_feature(const struct device *dev,
				     const struct nand_flash_feature *feature)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;
	int ret;

	k_sem_take(&dev_data->lock, K_FOREVER);

	if (dev_data->state == NAND_STATE_BUSY) {
		k_sem_give(&dev_data->lock);
		return -EBUSY;
	} else if (dev_data->state != NAND_STATE_READY) {
		k_sem_give(&dev_data->lock);
		return -EIO;
	}

	dev_data->state = NAND_STATE_BUSY;

	/* Send feature setting command sequence */
	sys_write8(NAND_CMD_SET_FEATURES, NAND_DEVICE | CMD_AREA);
	sys_write8(feature->feature_addr, NAND_DEVICE | ADDR_AREA);
	sys_write8(feature->feature_data[0], NAND_DEVICE);
	sys_write8(feature->feature_data[1], NAND_DEVICE);
	sys_write8(feature->feature_data[2], NAND_DEVICE);
	sys_write8(feature->feature_data[3], NAND_DEVICE);

	/* Read status until NAND is ready or reports an error */
	ret = flash_stm32_fmc_nand_wait();
	if (ret != 0) {
		dev_data->state = NAND_STATE_ERROR;
		k_sem_give(&dev_data->lock);
		return ret;
	}

	dev_data->state = NAND_STATE_READY;
	k_sem_give(&dev_data->lock);

	return 0;
}

static int flash_stm32_fmc_nand_init(const struct device *dev)
{
	struct flash_stm32_fmc_nand_data *dev_data = dev->data;
	uint32_t fmc_freq;

	dev_data->state = NAND_STATE_RESET;
	k_sem_init(&dev_data->lock, 1, 1);

	memc_stm32_fmc_clock_rate(&fmc_freq);
	LOG_DBG("FMC clock rate: %d Hz", fmc_freq);

#if STM32_FMC_NAND_USE_DMA
	if (dev_data->dma.enabled) {
		/*
		 * DMA configuration
		 * Due to use of NAND HAL and Zephyr API in current driver,
		 * both HAL and Zephyr DMA drivers should be configured.
		 */
		const struct flash_stm32_fmc_nand_config *config = dev->config;
		int ret;

		if (!device_is_ready(dev_data->dma.dev)) {
			LOG_ERR("DMA %s device is not ready", dev_data->dma.dev->name);
			return -ENODEV;
		}

		/*
		 * Proceed to the Zephyr DMA driver init
		 * Dummy configuration to avoid warnings in dma_config(). The correct addresses are
		 * set with dma_reload().
		 */
		dev_data->dma.block_cfg.source_address = (uint32_t)config->page_buffer;
		dev_data->dma.block_cfg.dest_address = (uint32_t)config->page_buffer;

		dev_data->dma.cfg.head_block = &dev_data->dma.block_cfg;

		ret = dma_config(dev_data->dma.dev, dev_data->dma.channel, &dev_data->dma.cfg);
		if (ret != 0) {
			LOG_ERR("Failed to configure DMA channel %d with error %d",
				dev_data->dma.channel, ret);
			return -EIO;
		}

		/* Proceed to the HAL DMA driver init */
		int index = find_lsb_set(dev_data->dma.cfg.source_data_size) - 1;

		/* Fill the structure for dma init */
		dev_data->dma.handle.Init.Request = 0; /* Zero for memory-to-memory transfer */
		dev_data->dma.handle.Init.Direction = DMA_MEMORY_TO_MEMORY;
		dev_data->dma.handle.Init.SrcInc = DMA_SINC_INCREMENTED;
		dev_data->dma.handle.Init.DestInc = DMA_DINC_INCREMENTED;
		dev_data->dma.handle.Init.SrcDataWidth = table_src_size[index];
		dev_data->dma.handle.Init.DestDataWidth = table_dest_size[index];
		dev_data->dma.handle.Init.Priority =
			table_priority[dev_data->dma.cfg.channel_priority];
		dev_data->dma.handle.Init.SrcBurstLength = 64;
		dev_data->dma.handle.Init.DestBurstLength = 64;
		dev_data->dma.handle.Init.TransferAllocatedPort =
			DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
		dev_data->dma.handle.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
		dev_data->dma.handle.Init.Mode = DMA_NORMAL;
		dev_data->dma.handle.Instance =
			STM32_DMA_GET_INSTANCE(dev_data->dma.reg, dev_data->dma.channel);

