zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_fmc_nand.c
		if (HAL_DMA_Init(&dev_data->dma.handle) != HAL_OK) {
			LOG_ERR("FMC NAND DMA Init failed");
			return -EIO;
		}

		LOG_INF("FMC NAND with DMA transfer");
	}
#endif /* STM32_FMC_NAND_USE_DMA */

	return 0;
}

/* This function is executed in the interrupt context */
#if STM32_FMC_NAND_USE_DMA
static void fmc_nand_dma_callback(const struct device *dev, void *user_data, uint32_t channel,
				  int status)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(user_data);

	if (status < 0) {
		LOG_ERR("DMA callback error %d with channel %d", status, channel);
	}
}

#define DMA_CHANNEL_CONFIG(node, dir) DT_DMAS_CELL_BY_NAME(node, dir, channel_config)

#define FMC_NAND_DMA_CHANNEL_INIT(node, dir)                                                       \
	.enabled = true, .reg = (DMA_TypeDef *)DT_REG_ADDR(DT_PHANDLE_BY_NAME(node, dmas, dir)),   \
	.dev = DEVICE_DT_GET(DT_DMAS_CTLR(node)),                                                  \
	.channel = DT_DMAS_CELL_BY_NAME(node, dir, channel),                                       \
	.cfg = {                                                                                   \
		.channel_direction = MEMORY_TO_MEMORY,                                             \
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(DMA_CHANNEL_CONFIG(node, dir)),      \
		.source_data_size =                                                                \
			STM32_DMA_CONFIG_PERIPHERAL_DATA_SIZE(DMA_CHANNEL_CONFIG(node, dir)),      \
		.dest_data_size =                                                                  \
			STM32_DMA_CONFIG_MEMORY_DATA_SIZE(DMA_CHANNEL_CONFIG(node, dir)),          \
		.source_burst_length = 64,                                                         \
		.dest_burst_length = 64,                                                           \
		.block_count = 1,                                                                  \
		.dma_callback = fmc_nand_dma_callback,                                             \
	}

#define FMC_NAND_DMA_CHANNEL(node, dir)                                                            \
	.dma = {COND_CODE_1(DT_DMAS_HAS_NAME(node, dir),                                           \
			    (FMC_NAND_DMA_CHANNEL_INIT(node, dir)),                                \
			    (NULL))},
#else
#define FMC_NAND_DMA_CHANNEL(node, dir)
#endif /* STM32_FMC_NAND_USE_DMA */

#define FLASH_STM32_FMC_NAND_INIT(n)                                                               \
	static uint8_t __nocache __aligned(PAGE_BUFFER_ALIGNMENT)                                  \
	flash_stm32_fmc_nand_page_buffer_##n[DT_INST_PROP(n, page_buffer_size)];                   \
                                                                                                   \
	static const struct flash_stm32_fmc_nand_config flash_stm32_fmc_nand_config_##n = {        \
		.page_buffer = flash_stm32_fmc_nand_page_buffer_##n,                               \
	};                                                                                         \
                                                                                                   \
	static struct flash_stm32_fmc_nand_data flash_stm32_fmc_nand_data_##n = {                  \
		FMC_NAND_DMA_CHANNEL(DT_DRV_INST(n), tx_rx)};                                      \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(n, flash_stm32_fmc_nand_init, NULL, &flash_stm32_fmc_nand_data_##n,  \
			      &flash_stm32_fmc_nand_config_##n, POST_KERNEL,                       \
			      CONFIG_FLASH_INIT_PRIORITY, NULL);

DT_INST_FOREACH_STATUS_OKAY(FLASH_STM32_FMC_NAND_INIT)
